InformationRegisters/ЛБ_ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостоянияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостоянияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостоянияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПредположительно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СостоянияСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СостоянияСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаВОтпускеПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойНеЗависящийОтРаботодателяИРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеПоНевыясненнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускОсновной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпускНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйОплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеССохранениемОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеГосударственныхОбязанностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниНеОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынужденныйПрогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Болезнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоЗаконодательству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговорПриостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПриемНаРаботу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ДолжностиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Увольнение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ДолжностиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_Совмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Совмещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_Заместители</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СовмещающийСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсутствующийСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЛБ_Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/obmen/Ext/Module.bsl
Функция GetReport(Param)      
	ОтветСервиса = "400";
	
	
	ДанныеОбмена = ЗначениеИзСтрокиВнутр(Param);  
	
	СтруктураРеквизитов = ДанныеОбмена.СтруктураОсновныхРеквизитов; 
	
	Если СтруктураРеквизитов.ТипСсылки = "ФизическоеЛицо" Тогда
		
		GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
		Ссылка = Справочники.ФизическиеЛица.ПолучитьСсылку(GUID);
		
		Об = Ссылка.ПолучитьОбъект();
		Если Об = Неопределено Тогда  						
			НовОб = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовОб.УстановитьСсылкуНового(Ссылка);
		Иначе
			НовОб = Об; 
		КонецЕсли; 
		
		НовОб.ДатаРождения 					= СтруктураРеквизитов.ДатаРождения;
		НовОб.Наименование 					= СтруктураРеквизитов.ФИО;
		НовОб.ИНН 							= СтруктураРеквизитов.ИНН;  
		НовОб.Фамилия 						= СтруктураРеквизитов.Фамилия;
		НовОб.Имя 							= СтруктураРеквизитов.Имя;
		НовОб.Отчество 						= СтруктураРеквизитов.Отчество;
		НовОб.Инициалы 						= СтруктураРеквизитов.Инициалы;
		
		НовОб.СерияДокумента                = СтрЗаменить(СтруктураРеквизитов.ДокументСерия," ","");
		НовОб.НомерДокумента                = СтруктураРеквизитов.ДокументНомер;
		НовОб.КемВыданДокумент              = СтруктураРеквизитов.ДокументКемВыдан;
		НовОб.КодПодразделенияДокумента     = СтруктураРеквизитов.ДокументКодПодразделения;
		НовОб.ДатаВыдачиДокумента           = СтруктураРеквизитов.ДокументДатаВыдачи;
		
		
		ОтветСервиса = "200";
		Попытка 		
			НовОб.Записать();
		Исключение
			ОтветСервиса = "Ошибка при записи физлица";
		КонецПопытки;   
		
		Если ОтветСервиса = "200" Тогда
			СтруктураФио = ДанныеОбмена.СтруктураФИО;		
			тзФио = СтруктураФио.тзФио;
			
			НаборЗаписей = РегистрыСведений.ЛБ_ФИОФизическихЛиц.СоздатьНаборЗаписей();		
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(НовОб.Ссылка);
			
			Для каждого строч из тзФио Цикл 				
				НоваяЗапись 				= НаборЗаписей.Добавить();
				НоваяЗапись.Период   		= строч.Период;
				НоваяЗапись.ФизическоеЛицо  = НовОб.Ссылка; 
				НоваяЗапись.Фамилия 	    = строч.Фамилия;
				НоваяЗапись.Имя 			= строч.Имя; 
				НоваяЗапись.Отчество 		= строч.Отчество;
				НоваяЗапись.Инициалы 		= строч.Инициалы;
				НоваяЗапись.ФИОСлужебные = СокрЛП(строч.Фамилия) + " "+СокрЛП(строч.Имя)+" "+СОкрЛП(строч.Отчество);
			КонецЦикла;	
			НаборЗаписей.Записать(); 
         КонецЕсли;	
		
	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "Сотрудник" Тогда
		
		GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
		Ссылка = Справочники.ЛБ_Сотрудники.ПолучитьСсылку(GUID);
		
		Об = Ссылка.ПолучитьОбъект();
		Если Об = Неопределено Тогда
			НовОб = Справочники.ЛБ_Сотрудники.СоздатьЭлемент();
			НовОб.УстановитьСсылкуНового(Ссылка); 
			НовОб.Код = СтруктураРеквизитов.Код;
		Иначе
			НовОб = Об; 
		КонецЕсли; 

		НовОб.Наименование 					= СтруктураРеквизитов.Наименование;
		
		guid_Физлицо = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Физлицо);  				
		СсылкаФизЛ = Справочники.ФизическиеЛица.ПолучитьСсылку(guid_Физлицо);
		
		ФизЛицо = СсылкаФизЛ.ПолучитьОбъект();
		Если ФизЛицо = Неопределено Тогда  						

		Иначе
			НовОб.ФизическоеЛицо = СсылкаФизЛ; 
		КонецЕсли;
		
		Если СтруктураРеквизитов.guid_Должность <> "0" Тогда
			guid_Должность = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Должность);  				
			СсылкаДолжность = Справочники.Должности.ПолучитьСсылку(guid_Должность);
			
			Должность = СсылкаДолжность.ПолучитьОбъект();
			Если Должность = Неопределено Тогда  						
				
			Иначе
				НовОб.Должность = СсылкаДолжность; 
			КонецЕсли;
		КонецЕсли; 
		НовОб.ДатаПриема = СтруктураРеквизитов.ДатаПриема; 
		НовОб.ДатаУвольнения = СтруктураРеквизитов.ДатаУвольнения;
		
		ОтветСервиса = "200";
		Попытка 		
			НовОб.Записать();
		Исключение
			ОтветСервиса = "Ошибка при записи сотрудника";
		КонецПопытки;  
		
		Если ОтветСервиса = "200" Тогда
			СтруктураТзСост = ДанныеОбмена.СтруктураСостояния;		
			тзСост = СтруктураТзСост.тзСост;
			
			НаборЗаписей = РегистрыСведений.ЛБ_СостоянияСотрудников.СоздатьНаборЗаписей();		
			НаборЗаписей.Отбор.Сотрудник.Установить(НовОб.Ссылка);
			
			Для каждого строч из тзСост Цикл 				
				НоваяЗапись 			= НаборЗаписей.Добавить(); 
				НоваяЗапись.Сотрудник   = НовОб.Ссылка; 
				НоваяЗапись.Год 	    = строч.Год;
				НоваяЗапись.Период 		= строч.Период; 
				НоваяЗапись.ДействуетДо = строч.ДействуетДо;
				сост = Перечисления.ЛБ_СостоянияСотрудника[строч.Состояние];
				НоваяЗапись.Состояние   = сост;    
				НоваяЗапись.ВидВремени  = ВернутьВидВремениСостояния(сост);
				НоваяЗапись.ДокументОснование = строч.ДокументОснование;
			КонецЦикла;	
			НаборЗаписей.Записать();   
			
			СтруктураТзКадр = ДанныеОбмена.СтруктураКадровойИстории;		
			тзКадроваяИсторияСотрудников = СтруктураТзКадр.тзКадроваяИсторияСотрудников;
			
			НаборЗаписей = РегистрыСведений.ЛБ_КадроваяИсторияСотрудников.СоздатьНаборЗаписей();		
			НаборЗаписей.Отбор.Сотрудник.Установить(НовОб.Ссылка);
			
			Для каждого строч из тзКадроваяИсторияСотрудников Цикл 				
				НоваяЗапись 			= НаборЗаписей.Добавить(); 
				НоваяЗапись.Сотрудник   = НовОб.Ссылка; 
				
				НоваяЗапись.Период 		  = строч.Период; 
				Если строч.Администрация Тогда
					
					НоваяЗапись.Подразделение  = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;
				Иначе	
					
					
					Если ЗначениеЗаполнено(строч.idLX_Подразделение) Тогда
						СсылкаПодразделение = ВернутьЛомбардПоИД(строч.idLX_Подразделение); 
						Если СсылкаПодразделение <> Неопределено Тогда
							НоваяЗапись.Подразделение = СсылкаПодразделение;
						КонецЕсли; 
					Иначе 
						СсылкаПодразделение = Справочники.ЛБ_Ломбарды.НайтиПоНаименованию(строч.НаимПодразделение);
						Если СсылкаПодразделение <> справочники.ЛБ_Ломбарды.ПустаяСсылка() Тогда
							НоваяЗапись.Подразделение = СсылкаПодразделение;
						КонецЕсли; 				
					КонецЕсли;  
				КонецЕсли;

				
				Если строч.guid_Должность <> "0" Тогда
					guid_Должность = Новый УникальныйИдентификатор(строч.guid_Должность);  				
					СсылкаДолжность = Справочники.Должности.ПолучитьСсылку(guid_Должность);
					
					Должность = СсылкаДолжность.ПолучитьОбъект();
					Если Должность = Неопределено Тогда  						
						
					Иначе
						НоваяЗапись.Должность = СсылкаДолжность; 
					КонецЕсли;
				КонецЕсли;

				ВидСобытия = Перечисления.ЛБ_ВидыКадровыхСобытий[строч.ВидСобытияСтр];
				НоваяЗапись.ВидСобытия   = ВидСобытия;
			
			КонецЦикла;	
			НаборЗаписей.Записать(); 

		КонецЕсли;

	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "Должность" Тогда
		
		GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
		Ссылка = Справочники.Должности.ПолучитьСсылку(GUID);
		
		Об = Ссылка.ПолучитьОбъект();
		Если Об = Неопределено Тогда  						
			НовОб = Справочники.Должности.СоздатьЭлемент();
			НовОб.УстановитьСсылкуНового(Ссылка);
		Иначе
			НовОб = Об; 
		КонецЕсли; 
		
		Наим = СтруктураРеквизитов.Наименование; 
		
		НовОб.Наименование 					= Наим; 
		
		нНаим = нрег(Наим);
		
		Если (СтрНайти(нНаим, "начальник") > 0) и (СтрНайти(нНаим, "отделения") > 0) и (СтрНайти(нНаим, "заместит") = 0) Тогда
			НовОб.ЯвляетсяНачальникомОтделения = Истина;			
		КонецЕсли;
		Если (СтрНайти(нНаим, "начальник") > 0) и (СтрНайти(нНаим, "отделения") > 0) и (СтрНайти(нНаим, "заместитель") > 0) Тогда
			НовОб.ЯвляетсяЗаместителемНачальникаОтделения = Истина;			
		КонецЕсли; 
		Если (СтрНайти(нНаим, "управляющий") > 0) и (СтрНайти(нНаим, "ломбард") > 0) Тогда
			НовОб.ЯвляетсяУправляющимЛомбарда = Истина;			
		КонецЕсли;

		
		ОтветСервиса = "200";
		Попытка 		
			НовОб.Записать();
		Исключение
			ОтветСервиса = "Ошибка при записи должности";
		КонецПопытки; 
		
		
	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "Пользователь" Тогда
		ПараметрыПольз = Новый Структура;
		ПараметрыПольз.Вставить("ИмяПользователя",  		СтруктураРеквизитов.ИмяПользователя);  
		ПараметрыПольз.Вставить("ИмяВходаПользователя",  	СтруктураРеквизитов.ИмяВходаПользователя);
		ПараметрыПольз.Вставить("Пароль",  					СтруктураРеквизитов.Пароль);
		ПараметрыПольз.Вставить("ИмяПрофиля",  				СтруктураРеквизитов.ИмяПрофиля);
		ПараметрыПольз.Вставить("guid_Физлица",  			СтруктураРеквизитов.guid_Физлица);
		
		ЛБ_ОбменLX.СоздатьПользователя(ПараметрыПольз);
		ОтветСервиса = "200";  
		
	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "Подразделение" Тогда
		
		//GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
		//Ссылка = Справочники.ЛБ_Ломбарды.ПолучитьСсылку(GUID);
		//
		//Об = Ссылка.ПолучитьОбъект();
		//Если Об = Неопределено Тогда  						
		//	НовОб = Справочники.ЛБ_Ломбарды.СоздатьЭлемент();
		//	НовОб.УстановитьСсылкуНового(Ссылка);
		//Иначе
		//	НовОб = Об; 
		//КонецЕсли; 
		//
		//Если ЗначениеЗаполнено(НовОб.НомерЛомбарда) Тогда
		//	НовОб.Наименование 					= НовОб.НомерЛомбарда;
		//Иначе
		//	НовОб.Наименование 					= СтруктураРеквизитов.Наименование;

		//КонецЕсли;
		//НовОб.НаименованиеПолное            = СтруктураРеквизитов.Наименование;
		//
		//Если СтруктураРеквизитов.guid_Родителя <> "нет" Тогда 
		//	GUIDРодителя = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Родителя);  				
		//	СсылкаРодитель = Справочники.ЛБ_Ломбарды.ПолучитьСсылку(GUIDРодителя); 
		//	
		//	ОбРодитель = СсылкаРодитель.ПолучитьОбъект();
		//	Если Об <> Неопределено Тогда  						
		//		НовОб.Родитель = СсылкаРодитель;
		//	КонецЕсли;
		//КонецЕсли;	
		//	
		//ОтветСервиса = "200";
		//Попытка 		
		//	НовОб.Записать();
		//Исключение
		//	ОтветСервиса = "Ошибка при записи ломбарда";
		//КонецПопытки;    
		
	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "ПриемНаРаботу" Тогда
		ОтветСервиса = ЗагрузитьПриемНаРаботу(СтруктураРеквизитов);			
	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "Увольнение" Тогда
		ОтветСервиса = ЗагрузитьУвольнение(СтруктураРеквизитов);  
	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "Совмещение" Тогда
		ОтветСервиса = ЗагрузитьСовмещение(СтруктураРеквизитов);

	ИначеЕсли СтруктураРеквизитов.ТипСсылки = "СостояниеСотрудников" Тогда
		
	КонецЕсли;
	
	Возврат ОтветСервиса;
КонецФункции 

Функция ВернутьЛомбардПоИД(id_LX) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_Ломбарды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_Ломбарды КАК ЛБ_Ломбарды
	               |ГДЕ
	               |	ЛБ_Ломбарды.id_LX = &id_LX";
	Запрос.УстановитьПараметр("id_LX",id_LX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВернутьВидВремениСостояния(сост)
	Если сост = Перечисления.ЛБ_СостоянияСотрудника.Болезнь Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Болезнь;
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.БолезньБезОплаты Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.БолезньБезОплаты;
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.ВынужденныйПрогул Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ВынужденныйПрогул;
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.ДополнительныйОтпуск Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск; 
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.Командировка Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Командировка;
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.ОтпускОсновной Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ОсновнойОтпуск;
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.ОтпускПоБеременностиИРодам Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам;  
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.ОтпускПоУходуЗаРебенком Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.ОтпускУчебныйОплачиваемый Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.ОтпускНаОбучение; 
	ИначеЕсли сост = Перечисления.ЛБ_СостоянияСотрудника.Прогул Тогда
		Возврат Справочники.ЛБ_ВидыИспользованияРабочегоВремени.Прогулы;  
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат Неопределено;

КонецФункции


Функция ЗагрузитьПриемНаРаботу(СтруктураРеквизитов)
		GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
		Ссылка = Документы.ЛБ_ПриемНаРаботу.ПолучитьСсылку(GUID);
		
		Об = Ссылка.ПолучитьОбъект();
		Если Об = Неопределено Тогда  						
			НовОб = Документы.ЛБ_ПриемНаРаботу.СоздатьДокумент();
			НовОб.УстановитьСсылкуНового(Ссылка);
		Иначе
			НовОб = Об; 
		КонецЕсли;
		НовОб.Номер = СтруктураРеквизитов.Номер;
		НовОб.Дата = СтруктураРеквизитов.Дата;
		
		
		guid_Физлица      = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Физлица);
		СсылкаНаФизлицо   = Справочники.ФизическиеЛица.ПолучитьСсылку(guid_Физлица);
		
		guid_Должности    = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Должности);
		СсылкаНаДолжность = Справочники.Должности.ПолучитьСсылку(guid_Должности);
		
		
		НовОб.ФизическоеЛицо 			= СсылкаНаФизлицо;
		НовОб.Должность 				= СсылкаНаДолжность;
		
		ОтветСервиса = "200";
		Попытка 		
			НовОб.Записать(); 
			Если СтруктураРеквизитов.Проведен Тогда
				НовОб.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если НЕ СтруктураРеквизитов.Проведен Тогда
				НовОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			Если СтруктураРеквизитов.ПометкаУдаления Тогда
				НовОб.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
				НовОб.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Исключение
			ОтветСервиса = "Ошибка при записи приема на работу";
		КонецПопытки;  
		
		Возврат ОтветСервиса;
	КонецФункции

Функция ЗагрузитьУвольнение(СтруктураРеквизитов);
	
	GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
	Ссылка = Документы.ЛБ_Увольнение.ПолучитьСсылку(GUID);
	
	Об = Ссылка.ПолучитьОбъект();
	Если Об = Неопределено Тогда  						
		НовОб = Документы.ЛБ_Увольнение.СоздатьДокумент();
		НовОб.УстановитьСсылкуНового(Ссылка);
	Иначе
		НовОб = Об; 
	КонецЕсли;
	НовОб.Номер = СтруктураРеквизитов.Номер;
	НовОб.Дата = СтруктураРеквизитов.Дата;
	НовОб.ДатаУвольнения = СтруктураРеквизитов.ДатаУвольнения;
	
	
	guid_Физлица      = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Физлица);
	СсылкаНаФизлицо   = Справочники.ФизическиеЛица.ПолучитьСсылку(guid_Физлица);
	
	guid_Должности    = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_Должности);
	СсылкаНаДолжность = Справочники.Должности.ПолучитьСсылку(guid_Должности);
	
	
	НовОб.ФизическоеЛицо 			= СсылкаНаФизлицо;
	НовОб.Должность 				= СсылкаНаДолжность;
	
	ОтветСервиса = "200";
	Попытка 		
		НовОб.Записать(); 
		Если СтруктураРеквизитов.Проведен Тогда
			НовОб.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если НЕ СтруктураРеквизитов.Проведен Тогда
			НовОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		Если СтруктураРеквизитов.ПометкаУдаления Тогда
			НовОб.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
			НовОб.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	Исключение
		ОтветСервиса = "Ошибка при записи увольнения";
	КонецПопытки; 
	
	
	Возврат ОтветСервиса;
	
КонецФункции  

Функция ЗагрузитьСовмещение(СтруктураРеквизитов);
	
	GUID = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid);  				
	Ссылка = Документы.ЛБ_Совмещение.ПолучитьСсылку(GUID);
	
	Об = Ссылка.ПолучитьОбъект();
	Если Об = Неопределено Тогда  						
		НовОб = Документы.ЛБ_Совмещение.СоздатьДокумент();
		НовОб.УстановитьСсылкуНового(Ссылка);
	Иначе
		НовОб = Об; 
	КонецЕсли;
	НовОб.Номер = СтруктураРеквизитов.Номер;
	НовОб.Дата = СтруктураРеквизитов.Дата;
	НовОб.ДатаНачала = СтруктураРеквизитов.ДатаНачала;
	НовОб.ДатаОкончания = СтруктураРеквизитов.ДатаОкончания;
	
	
	guid_СовмещающийСотрудник      = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_СовмещающийСотрудник);
	СовмещающийСотрудник   = Справочники.ЛБ_Сотрудники.ПолучитьСсылку(guid_СовмещающийСотрудник); 
	
	guid_ОтсутствующийСотрудник      = Новый УникальныйИдентификатор(СтруктураРеквизитов.guid_ОтсутствующийСотрудник);
	ОтсутствующийСотрудник   = Справочники.ЛБ_Сотрудники.ПолучитьСсылку(guid_ОтсутствующийСотрудник);


	НовОб.СовмещающийСотрудник 			= СовмещающийСотрудник;
	НовОб.ОтсутствующийСотрудник 		= ОтсутствующийСотрудник;
	
	ОтветСервиса = "200";
	Попытка 		
		НовОб.Записать(); 
		Если СтруктураРеквизитов.Проведен Тогда
			НовОб.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Если НЕ СтруктураРеквизитов.Проведен Тогда
			НовОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		Если СтруктураРеквизитов.ПометкаУдаления Тогда
			НовОб.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
			НовОб.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	Исключение
		ОтветСервиса = "Ошибка при записи совмещения";
	КонецПопытки; 
	
	
	Возврат ОтветСервиса;
	
КонецФункции
